# Decision Tree Practice : Predict if a passenger survived or not based on the passenger's class, age, sex and fare.

In [1]:
import pandas as pd

In [58]:
df = pd.read_csv(r'C:\Users\91842\Desktop\Pandas Test Folder\titanic.csv')

In [59]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [60]:
#drop except pclass,survived,sex,age,fare:
df = df.drop(['name','sibsp','parch','ticket','cabin','embarked','boat','body','home.dest'], axis='columns')

In [62]:
df.head()

   pclass  survived     sex    age      fare
0       1         1  female  29.00  211.3375
1       1         1    male   0.92  151.5500
2       1         0  female   2.00  151.5500
3       1         0    male  30.00  151.5500
4       1         0  female  25.00  151.5500

In [63]:
df.describe()

            pclass     survived          age         fare
count  1309.000000  1309.000000  1046.000000  1308.000000
mean      2.294882     0.381971    29.881138    33.295479
std       0.837836     0.486055    14.413493    51.758668
min       1.000000     0.000000     0.170000     0.000000
25%       2.000000     0.000000    21.000000     7.895800
50%       3.000000     0.000000    28.000000    14.454200
75%       3.000000     1.000000    39.000000    31.275000
max       3.000000     1.000000    80.000000   512.329200

In [64]:
#check if there are any missing/null values:
df.isnull().sum()

pclass        0
survived      0
sex           0
age         263
fare          1
dtype: int64

In [67]:
#drop the missing value data:
df = df.dropna()

In [68]:
df.isnull().sum()

pclass      0
survived    0
sex         0
age         0
fare        0
dtype: int64

In [69]:
X = df.drop('survived', axis='columns')
y = df['survived']

In [70]:
#Use label encoder to convert the categorical column 'sex' into numerical:
#import necessary lib:
from sklearn.preprocessing import LabelEncoder

In [71]:
#create an object for the column 'sex':
le_sex = LabelEncoder()

In [72]:
#create a new column:
X['sex_new']  = le_sex.fit_transform(X['sex'])

In [73]:
#check if categorical columns are encoded into numbers or not:
X.head()

   pclass     sex    age      fare  sex_new
0       1  female  29.00  211.3375        0
1       1    male   0.92  151.5500        1
2       1  female   2.00  151.5500        0
3       1    male  30.00  151.5500        1
4       1  female  25.00  151.5500        0

In [74]:
#Now drop the categorial column:
X_n = X.drop(['sex'],axis='columns')
X_n.head()

   pclass    age      fare  sex_new
0       1  29.00  211.3375        0
1       1   0.92  151.5500        1
2       1   2.00  151.5500        0
3       1  30.00  151.5500        1
4       1  25.00  151.5500        0

In [75]:
#import necessary lib for decision tree:
from sklearn import tree

In [76]:
#create the model:
model = tree.DecisionTreeClassifier()

In [86]:
#train the model: We have not split the data here
model.fit(X_n,y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [87]:
#Let's check the score of the model:
model.score(X_n,y)

0.9770334928229665

It seems the score is high, so this a highly accurate model. 
But in real time, the dataset would be very complex and large, so score would vary accordingly.

In [92]:
#Let's predict some data: Predict when pclass=1, age=38, fare=153, sex=female, y or survived = 0 or 1?
model.predict([[1,38,153,0]])

array([1], dtype=int64)

In [93]:
#Let's predict the same data for male: Predict when pclass=1, age=38, fare=153, sex=male, y or survived = 0 or 1?
model.predict([[1,38,153,1]])

array([0], dtype=int64)

#### From the above 2 predictions it seems that for same pclass, age and fare the 'female' passenger survived but the 'male' passenger could not survive.

In [97]:
#highest paid fare is:
df.fare.max()

512.3292

In [100]:
#let's predict the highest payor survived or not:
model.predict([[1,40,512,1]])

array([1], dtype=int64)

In [101]:
model.predict([[1,40,512,0]])

array([1], dtype=int64)

#### From the above 2 predictions it seems that regardless of their sex the highest payor survived.

In [116]:
#let's find the most aged passenger travelled in titanic:
df.age.max()

80.0

In [117]:
model.predict([[1,80,120,1]])

array([1], dtype=int64)

#### From the above prediction it seems the most aged male passenger travelling in class 1 survived.

In [119]:
model.predict([[3,80,120,1]])

array([0], dtype=int64)

#### From the above prediction it seems the most aged male passenger travelling in class 3 could not survive.